0	0	
217	80	EMCO-\nLM800
218	80	Irco/FMB-\nlader
219	80	User\nCycle 3
220	80	User\nCycle 4
221	80	User\nCycle 5
222	80	User\nCycle 6
85000	80	Direc. X=0 Z=1
85001	80	Direction X=0 Z=1
85010	80	Nom du programme de tronþonnage
85012	80	Point de commutation G0 Ó G1
85014	80	Avance G1
85016	80	Position de reprise
85018	80	DÚcalage S1 en S2
85020	80	Appuyer 0=Non 1=Oui
85030	80	Position de prise en Z
85032	80	Position de butÚe en X
85034	80	Position finale en Z
85036	80	Position de dÚgagement en Z
85038	80	Position finale en Z Nouvelle barre
85040	80	Vitesse d'avance
85042	80	Temporisation chute derniere piece en sec.
85043	80	Temporisation avance recuperateur en sec.
85044	80	Derniere piece avant changement de barre 
85046	80	0= Usinage derniere piece 1= Ejection piece
85048	80	0=Recuperateur 1=Non recuperee 2=Sous-programme derniere piece
85049	80	1= derniere piece non recuperee 2= derniere piece usinee 
85050	80	Sous-programme de fin de barre
85052	80	Sous-programme de changement de barre
85054	80	Oscillation de broche a l'embarrage 0=off 1=on
85056	80	Attente de MX1 Fin Kupa
85057	80	Attente de MX2 Fin Kupa Start apres changement
85058	80	Attente lancement apres changement
85060	80	 Utilisat.
85062	80	 Transf.\npiece
85064	80	 Emb.
85066	80	 Emb.Kupa 
85068	80	 Emb.Emco 
85070	80	 Emb.\nIrco/FMB 
85071	80	 Emb.\nAutre 
85072	80	 Jauges \nd'Outils 
85074	80	 cor.out1
85076	80	 cor.out2
85078	80	 L1(X)_plus ...Fenetre de tolerance usure 
85080	80	 L1(X)_min ... Fenetre de tolerance usure 
85082	80	 L2(Z)_plus ...Fenetre de tolerance usure 
85084	80	 L2(Z)_min ... Fenetre de tolerance usure 
85086	80	 L1(X)_plus/min ...Limite de tolerance d'usure 
85088	80	 L2(Z)_plus/min ...Limite de tolerance d'usure 
85090	80	 Controle 0=L1(X)/L2(Z)  1=L1(X)  2=L2(Z)
85100	80	Tool station bar stop 
85102	80	T number 
85104	80	Tool correction bar stop 
85106	80	D number 
85108	80	New bar 
85110	80	Bar end PRG 
85112	80	Bar stop X 
85114	80	Bar stop position in Z 
85116	80	Bar stop Z 
85118	80	Bar stop position new bar in Z 
85120	80	New bar pos.
85122	80	Safety in Z 
85124	80	Dwell forwa.
85126	80	Dwell t. for remnant drop down 
85128	80	Dwell backw.
85130	80	1=Barstop 2=Supsp. 3=Barloader 
85132	80	Barfeed with 
85134	80	0=no bar stop 1=bar stop
85136	80	New bar stop
85138	80	Oscilating 
85140	80	1=ch.conv.2=p.ch.3=endprg.4=slide
85142	80	Bar end in
85144	80	only the 1st time(cycle twice)
85146	80	Part finish 
85148	80	Kupa-\nLM_92
85150	80	End of bar
85152	80	Part chatcher forward 
85154	80	Part slide forward
85156	80	Bar change activ - Waiting for input
85158	80	Barloder pushes forward ! - Waiting for input
